package practice.algorithm;

/**
 * 试题 算法训练 Sereja and Equality
 * 问题描述
 * 　　(注：这是codechef上的官方翻译)
 * 　　佳佳称两个长度为n的数组A,B相似，如果对于所有i(1≤i≤n)，满足C(A,Ai)=C(B,Bi)。其中C(X,x)等于满足X[j]<x(1≤j≤n)的j的数目。
 * 　　对于两个排列P1,P2，佳佳定义函数F(P1,P2)等于满足P1[l...r]相似于P2[l...r](1≤l≤r≤n)并且P1[l...r]包含不超过E个逆序对的数对(l,r)的数目。
 * 　　现在佳佳对下面这个问题发生了兴趣：对P1,P2取遍所有n个元素的排列F(P1,P2)的总和是多少。
 * 输入格式
 * 　　输入数据的第一行包含一个整数T——测试数据的组数。
 * 　　对于每组测试数据，仅包含一行两个整数n,E。
 * 输出格式
 * 　　对于每组测试数据，输出一行表示结果。答案对109+7取模。
 * 样例输入
 * 4
 * 2 2
 * 2 1
 * 2 0
 * 1 1
 * 样例输出
 * 10
 * 10
 * 9
 * 1
 * 数据规模和约定
 * 测试点比例	T≤	n≤	E≤
 * 6%	25	5	10
 * 4%	10000	5	10
 * 10%	10	10	50
 * 10%	10	20	200
 * 10%	10	100	5000
 * 10%	10	500	2000
 * 10%	10	500	1000000
 * 10%	10000	50	1000000
 * 30%	10000	500	1000000
 */

public class SerejaAndEquality {
    public static void main(String[] args) {

    }
}
